{
  "movies": [
    {
      "id": "1",
      "title": "Pulp Fiction",
      "category": "Drama, Action, Crime",
      "director": "Quentin Tarantino",
      "year": "1994",
      "time": "1:25h",
      "plot": "The lives of a boxer, two hitmen, a gangster's wife and two bandits intertwine in a story of violence and redemption.",
      "cast": "John Travolta, Samuel L. Jackson, Uma Thurman, Harvey Keitel, Tim Roth, Amanda Plummer, Maria de Medeiros, Ving Rhames, Eric Stoltz, Rosanna Arquette, Christopher Walken, Bruce Willis",
      "rating": "5",
      "comment": "Really good movie, I love it!",
      "img": "https://media.wired.com/photos/59323e2a52d99d6b984dd3f4/master/w_2560%2Cc_limit/Pulp-Fiction.jpg"
    },
    {
      "id": "2",
      "title": "Spider-Man: No Way Home",
      "category": "Action",
      "director": "Jon Watts",
      "year": "2021",
      "time": "1:35h",
      "plot": "Spider-Man seeks the help of Doctor Strange to forget his exposed secret identity as Peter Parker. However, Strange's spell goes horribly wrong, leading to unwanted guests entering their universe.",
      "cast": "Tom Holland, Zendaya, Benedict Cumberbatch, Jacob Batalon, Jon Favreau, Jamie Foxx, Willem Dafoe, Alfred Molina",
      "rating": "3.4",
      "comment": "Ok movie, I expected more.",
      "img": "https://1.bp.blogspot.com/-z0lgtf-4RVc/XSiK9MinsrI/AAAAAAAAHtY/BHjIKhwF7O0BqP2791Yfvq8lqgtEwjrAgCLcBGAs/s1600/spider-man-homecoming-tom-holland-1.jpg"
    },
    {
      "id": "3",
      "title": "Cowspiracy: The Sustainability Secret",
      "category": "Documental",
      "director": "Kip Andersen, Keegan Kuhn",
      "year": "2014",
      "time": "1:25h",
      "plot": "Follow the shocking, yet humorous, journey of an aspiring environmentalist, as he daringly seeks to find the real solution to the most pressing environmental issues and true path to sustainability.",
      "cast": "undefined",
      "rating": "4.6",
      "comment": "Interesting documentary, I recommend it!",
      "img": "https://bingeddata.s3.amazonaws.com/uploads/2020/11/cowspiracy-the-sustainability-secret-1.jpg"
    },
    {
      "id": "4",
      "title": "The Shawshank Redemption",
      "category": "Drama",
      "director": "Frank Darabont",
      "year": "1994",
      "time": "2:22h",
      "plot": "Andy Dufresne, a successful banker, is arrested for the murders of his wife and her lover, and is sentenced to life imprisonment at the Shawshank prison. He becomes the most unconventional prisoner.",
      "cast": "Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler, Clancy Brown, Gil Bellows, Mark Rolston, James Whitmore",
      "rating": "4.9",
      "comment": "One of the best movies I've ever seen!",
      "img": "https://media.assettype.com/filmcompanion%2F2023-10%2F9d38f505-bf52-4f68-85ad-07bb53e2a0e6%2FCover.png"
    },
    {
      "id": "5",
      "title": "The Godfather",
      "category": "Drama, Crime",
      "director": "Francis Ford Coppola",
      "year": "1972",
      "time": "2:55h",
      "plot": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
      "cast": "Marlon Brando, Al Pacino, James Caan, Richard S. Castellano, Robert Duvall, Sterling Hayden, John Marley, Richard Conte, Al Lettieri, Diane Keaton",
      "rating": "4.7",
      "comment": "Great movie, I love it!",
      "img": "https://th-thumbnailer.cdn-si-edu.com/XZrIkQoYfE9xH_ARoXzEQ60a7o0=/fit-in/1072x0/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer/The-Godfather-Effect-Don-Vito-520.jpg"

    },
    {
      "id": "6",
      "title": "The Dark Knight",
      "category": "Action, Crime, Drama",
      "director": "Christopher Nolan",
      "year": "2008",
      "time": "2:32h",
      "plot": "When the menace known as The Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
      "cast": "Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine, Maggie Gyllenhaal, Gary Oldman, Morgan Freeman",
      "rating": "4.8",
      "comment": "One of the best movies I've ever seen!",
      "img": "https://img2.hulu.com/user/v3/artwork/2ce6365a-46e7-43d9-8d77-5b84753a663c?base_image_bucket_name=image_manager&base_image=99f4361c-662b-4693-89d7-7519197f9c40&size=458x687&format=webp"
    },
    {
      "id": "7",
      "title": "The Lord of the Rings: The Return of the King",
      "category": "Action, Adventure, Drama",
      "director": "Peter Jackson",
      "year": "2003",
      "time": "3:21h",
      "plot": "Frodo and Sam, led by Gollum, are on their way towards Mount Doom, in order to destroy the Ring. Meanwhile, Gandalf and Aragorn, lead the World of Men in the final battle for Middle-earth.",
      "cast": "Elijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Orlando Bloom, John Rhys-Davies, Bernard Hill, Christopher Lee, Billy Boyd, Dominic Monaghan, Hugo Weaving, Miranda Otto, David Wenham, Karl Urban, John Noble, Andy Serkis, Ian Holm, Sean Bean, Liv Tyler, Cate Blanchett, Lawrence Makoare, Sala Baker",
      "rating": "4.9",
      "comment": "One of the best movies I've ever seen!",
      "img": "https://static1.srcdn.com/wordpress/wp-content/uploads/The-Lord-of-the-Rings-the-Return-of-of-the-King-Peter-Jackson.jpg"
    },
    {
      "id": "8",
      "title": "The Matrix",
      "category": "Action, Sci-Fi",
      "director": "Lana Wachowski, Lilly Wachowski",
      "year": "1999",
      "time": "2:16h",
      "plot": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.",
      "cast": "Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving, Joe Pantoliano, Marcus Chong, Julian Arahanga, Matt Doran, Gloria Foster, Belinda McClory, Anthony Ray Parker, Paul Goddard, Robert Taylor",
      "rating": "4.8",
      "comment": "One of the best movies I've ever seen!",
      "img": "https://images.bauerhosting.com/legacy/empire-tmdb/films/603/images/7u3pxc0K1wx32IleAkLv78MKgrw.jpg?ar=16:9&fit=crop&crop=top"
    },
    {
      "id": "9",
      "title": "Shutter Island",
      "category": "Mystery, Thriller",
      "director": "Martin Scorsese",
      "year": "2010",
      "time": "2:18h",
      "plot": "Teddy Daniels and Chuck Aule, two US marshals, are sent to an asylum on a remote island in order to investigate the disappearance of a patient, where Teddy uncovers a shocking truth about the place.",
      "cast": "Leonardo DiCaprio, Mark Ruffalo, Ben Kingsley, Max von Sydow, Michelle Williams, Emily Mortimer, Patricia Clarkson, Jackie Earle Haley, Ted Levine, John Carroll Lynch, Elias Koteas, Robin Bartlett, Christopher Denham, Nellie Sciutto, Joseph Sikora, Curtiss Cook, Joseph McKenna, Ruby Jerins, Tom Kemp, Bates Wilder, Drew Beasley, Steve Witting, Jill Larson, Ray Medved, Joseph P. Reidy, Ruby Jerins, Tom Kemp, Bates Wilder, Drew Beasley, Steve Witting, Jill Larson, Ray Medved, Joseph P. Reidy",
      "rating": "4.7",
      "comment": "Great movie, I love it!",
      "img": "https://m.media-amazon.com/images/S/pv-target-images/1b3a85ea2c60609c0bd9d29736c2c2d93247c4121cf64e7c24af2cb76eb81c56.jpg"
    },
    {
      "id": "10",
      "title": "Snatch",
      "category": "Comedy, Crime",
      "director": "Guy Ritchie",
      "year": "2000",
      "time": "1:44h",
      "plot": "Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers and supposedly Jewish jewelers fight to track down a priceless stolen diamond.",
      "cast": "Benicio Del Toro, Dennis Farina, Vinnie Jones, Brad Pitt, Rade Serbedzija, Jason Statham, Alan Ford, Mike Reid, Robbie Gee, Lennie James, Ewen Bremner, Jason Flemyng, Ade, Goldie, William Beck, Andy Beckwith, Jason Buckham, Mickey Cantwell, Teena Collins, Charles Cork, Sorcha Cusack, Adam Fogerty, Sam Douglas, Dave Legeno, Stephen Graham, Sid Hoare, Velibor Topic, Guy Ritchie, Elwin 'Chopper' David, Joe Williams, Yuri Stepanov, Sam Douglas, Mike Reid, Robbie Gee, Lennie James, Ewen Bremner, Jason Flemyng, Ade, Goldie, William Beck, Andy Beckwith, Jason Buckham, Mickey Cantwell, Teena Collins, Charles Cork, Sorcha Cusack, Adam Fogerty, Sam Douglas, Dave Legeno, Stephen Graham, Sid Hoare, Velibor Topic, Guy Ritchie, Elwin 'Chopper' David, Joe Williams, Yuri Stepanov",
      "rating": "4.6",
      "comment": "Great movie, I love it!",
      "img": "https://static.wikia.nocookie.net/snatch/images/1/1a/Snatch_Film_Poster.jpg"
    }
  ]
}